eclipse-threadx/getting-started/STMicroelectronics/B-L4S5I-IOT01A/lib/stm32cubel4/Drivers/BSP/B-L4S5I-IOT01/stm32l4s5i_iot01.c
  return 0;
}

/**
  * @brief  DeInitializes Sensors low level.
  * @retval None
  */
uint32_t NFC_IO_DeInit(void)
{
  I2Cx_DeInit(&hI2cHandler);
  return 0;
}

/**
  * @brief  Checks if target device is ready for communication.
  * @param  Addr  NFC device I2C address
  * @param  Trials  Number of trials
  * @retval Status  Success or Timeout
  */
uint32_t NFC_IO_IsDeviceReady (uint16_t Addr, uint32_t Trials)
{
    HAL_StatusTypeDef status;
    uint32_t tickstart = 0;
    uint32_t currenttick = 0;
    
    /* Get tick */
    tickstart = HAL_GetTick();
    
    /* Wait until NFC device is ready or timeout occurs */
    do
    {
        status = HAL_I2C_IsDeviceReady(&hI2cHandler, Addr, Trials, NFC_I2C_TIMEOUT_STD);
        currenttick = HAL_GetTick();
    } while( ( (currenttick - tickstart) < NFC_I2C_TIMEOUT_MAX) && (status != HAL_OK) );
    
    if (status != HAL_OK)
    {
        return NFC_I2C_ERROR_TIMEOUT;
    } 

    return NFC_I2C_STATUS_SUCCESS;
}

/**

  * @brief  Write a value in a register of the device through BUS.
  * @param  DevAddr Device address on Bus.
  * @param  Reg    The target register address to write

  * @param  pData  Pointer to data buffer to write
  * @param  Length Data Length
  * @retval BSP statu
  */
int32_t NFC_IO_WriteReg16(uint16_t DevAddr, uint16_t Reg, uint8_t *pData, uint16_t Length) 
{
  int32_t ret = -8;
  uint32_t hal_error = HAL_OK;
  
  if (HAL_I2C_Mem_Write(&hI2cHandler, (uint8_t)DevAddr,
                       (uint16_t)Reg, I2C_MEMADD_SIZE_16BIT,
                       (uint8_t *)pData, Length, 0x1000) == HAL_OK)
  {
    ret = 0;
  }
  else
  {
    hal_error = HAL_I2C_GetError(&hI2cHandler);
    if ( hal_error == HAL_I2C_ERROR_AF)
    {
      return NFC_I2C_ERROR_NACK;
    }
    else
    {
      ret =  NFC_I2C_ERROR_PERIPHERAL;
    }
  }
  return ret;
}

/**
  * @brief  Read registers through a bus (16 bits)
  * @param  DevAddr: Device address on BUS
  * @param  Reg: The target register address to read
  * @param  Length Data Length
  * @retval BSP status
  */
int32_t  NFC_IO_ReadReg16(uint16_t DevAddr, uint16_t Reg, uint8_t *pData, uint16_t Length) 
{
  int32_t ret = -8;
  uint32_t hal_error = HAL_OK;
 
  if (HAL_I2C_Mem_Read(&hI2cHandler, DevAddr, (uint16_t)Reg,
                       I2C_MEMADD_SIZE_16BIT, pData,
                       Length, 0x1000) == HAL_OK)
  {
    ret = 0;
  }
  else
  {
    hal_error = HAL_I2C_GetError(&hI2cHandler);
    if( hal_error == HAL_I2C_ERROR_AF)
    {
      return NFC_I2C_ERROR_NACK;
    }
    else
    {
      ret =  NFC_I2C_ERROR_PERIPHERAL;
    }
  }
  return ret;
}

/**
  * @brief  Tick function used in NFC device low level driver.
  * @retval Current Tick
  */
uint32_t NFC_IO_Tick(void)
{
  return HAL_GetTick();
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
